homes = [

    {"name": "Home #1", "description":  
    "**О доме:**\n"     
    "Дом 600 м². 52,3 сот.\n"            
    "Количество комнат: 4\n" 
    "Площадь дома: 600 м²\n"              
    "Площадь участка: 52.3 сот.\n"              
    "Этажей в доме: 2\n"              
    "Категория земель: индивидуальное жилищное строительство\n"             
    "Материал стен: кирпич\n"             
    "Ремонт: дизайнерский\n"             
    "Расстояние от МКАД: 14 км\n", 
    "info": "52,3 сот.",               
    "price": 25000000, "image": "https://i.pinimg.com/originals/de/49/8e/de498e564f09f479af15e8938c61cc6e.jpg"},

    {"name": "Home #2", "description":  
    "**О доме:**\n"     
    "Дом 300 м². 10,3 сот.\n"            
    "Количество комнат: 3\n" 
    "Площадь дома: 300 м²\n"              
    "Площадь участка: 52.3 сот.\n"              
    "Этажей в доме: 2\n"              
    "Категория земель: индивидуальное жилищное строительство\n"             
    "Материал стен: кирпич\n"             
    "Ремонт: дизайнерский\n"             
    "Расстояние от МКАД: 8 км\n", 
    "info": "10,3 сот.",               
    "price": 15000000, "image": "https://i.pinimg.com/originals/00/d4/4c/00d44c27aa3bcbd2d3b1aa92e384ea16.jpg"},

    {"name": "Home #3", "description":  
    "**О доме:**\n"     
    "Дом 340 м². 6,8 сот.\n"            
    "Количество комнат: 4\n" 
    "Площадь дома: 340 м²\n"              
    "Площадь участка: 6.8 сот.\n"              
    "Этажей в доме: 4\n"              
    "Категория земель: индивидуальное жилищное строительство\n"             
    "Материал стен: кирпич\n"             
    "Ремонт: дизайнерский\n"             
    "Расстояние от МКАД: 15 км\n", 
    "info": "6,8 сот.",               
    "price": 10000000, "image": "https://avatars.mds.yandex.net/i?id=5521377b2563827bfe72fccc71592935_l-9100837-images-thumbs&n=13"},

    {"name": "Home #4", "description":  
    "**О доме:**\n"     
    "Дом 200 м². 5,6 сот.\n"            
    "Количество комнат: 4\n" 
    "Площадь дома: 150 м²\n"              
    "Площадь участка: 5.6 сот.\n"              
    "Этажей в доме: 3\n"              
    "Категория земель: индивидуальное жилищное строительство\n"             
    "Материал стен: кирпич\n"             
    "Ремонт: дизайнерский\n"             
    "Расстояние от МКАД: 28 км\n", 
    "info": "5,6 сот.",               
    "price": 7500000, "image": "https://sun9-1.userapi.com/impf/c848620/v848620432/80a4c/jAdeKQdHRi8.jpg?size=1280x905&quality=96&sign=2d03e96a477e167e2af524dbcb687b98&c_uniq_tag=j3J5U6hMVNKEZpme6ZK4IVRxqV04FJ1-ohnjCjnMFo8&type=album"},

    {"name": "Home #5", "description":  
    "**О доме:**\n"     
    "Дом 120 м². 2,4 сот.\n"            
    "Количество комнат: 2\n" 
    "Площадь дома: 150 м²\n"              
    "Площадь участка: 2.4 сот.\n"              
    "Этажей в доме: 1\n"              
    "Категория земель: индивидуальное жилищное строительство\n"             
    "Материал стен: дерево/брус\n"             
    "Ремонт: дизайнерский\n"             
    "Расстояние от МКАД: 48 км\n", 
    "info": "2,4 сот.",               
    "price": 1500000, "image": "https://sun9-86.userapi.com/impg/UW8xXHAw6Rz4gzLldGlqeC3hwdkpXDV1mS9ddA/ZKsyQZ6WjXM.jpg?size=1280x835&quality=95&sign=1269a6fe2d79218de8360ee5475ad4c8&c_uniq_tag=_vf_LnrSTYrMPaG2X3RBVkN_zTn284UMH404xT5csBs&type=album"},


]