homes = [

    {"name": "Home S+", "description":  
    "**О доме:**\n"     
    "Дом 600 м². 52,3 сот.\n"            
    "Количество комнат: 4\n" 
    "Площадь дома: 600 м²\n"              
    "Площадь участка: 52.3 сот.\n"              
    "Этажей в доме: 2\n"              
    "Категория земель: индивидуальное жилищное строительство\n"             
    "Материал стен: кирпич\n"             
    "Ремонт: дизайнерский\n"             
    "Расстояние от МКАД: 14 км\n", 
    "info": "52,3 сот.",               
    "price": 25000000, "image": "https://i.pinimg.com/originals/de/49/8e/de498e564f09f479af15e8938c61cc6e.jpg"},

]