cars = [

    {"name": "BMW F90", "description":  
    "**BMW M5 2018**\n"               
    "**Характеристики:**\n" 
    "Год выпуска: 2018\n"              
    "Поколение: F90 (2017—2020)\n"              
    "Пробег: 56 000 км\n"              
    "ПТС: Оригинал\n"             
    "Владельцев по ПТС: 1\n"             
    "Состояние: Не битый\n"             
    "Модификация: 4.4 AT (625 л.с.)\n"              
    "Объём двигателя: 4.4 л\n"              
    "Привод: Полный К/П: Авто",     
    "price": 9500000, "image": "https://avatars.mds.yandex.net/get-autoru-vos/5238237/e9a5f74c0dc83b0187566312601bf258/1200x900"},

    {"name": "Subaru", "description": 
    "**Subaru BRZ**\n"                 
    "**Характеристики:**\n" 
    "Год выпуска: 2017\n"              
    "Поколение: ZC рестайлинг (2016—2020)\n"              
    "Пробег: 35 000 км\n"              
    "ПТС: Электронный\n"             
    "Владельцев по ПТС: 1\n"             
    "Состояние: Не битый\n "             
    "Модификация: 2.0 MT (207 л.с.)\n"              
    "Объём двигателя: 2 л\n"              
    "Привод: Задний К/П: Механика",  
    "price": 2350000, "image": "https://ekat.subaru.ru/uploads/news/d42deb7f28210e30d2f504a9f54cb32d.jpg"},

    {"name": "Audi A7", "description": 
    "**Audi A7 AMT**\n"              
    "**Характеристики:**\n" 
    "Год выпуска: 2014\n"              
    "Поколение: I (2010—2014)\n"              
    "Пробег: 198 000 км\n "              
    "ПТС: Оригинал\n"             
    "Владельцев по ПТС: 3\n"             
    "Состояние: Не битый\n"             
    "Модификация: 2.8 FSI quattro S tronic (204 л.с.)\n"              
    "Объём двигателя: 2.8 л\n"              
    "Привод: Полный К/П: Робот", 
    "price": 1976000, "image": "https://avatars.mds.yandex.net/get-autoru-vos/11396317/0d4a439193af334d7e6a0501d7a83d66/1200x900"},
]